src/artillery/user.yaml
config:
  target: http://localhost:8080/bank
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: bank
    flow:
      - get:
          url: /users